function MyGo
    %%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
    % Callback-функция MyGo для кнопки Go
    %%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
    global hAxes hEd1 hEd2 hEd3 hEd4
    global hList
    %%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
    % Считываем строковые данные из окна интерфейса
    %%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
    str1=get(hEd1,'String');
    str2=get(hEd2,'String');
    str3=get(hEd3,'String');
    str4=get(hEd4,'String');
    %%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
    % Преобразовываем строки в числа
    %%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
    x0=str2num(str1); 
    y0=str2num(str2);
    xf=str2num(str3); 
    N=str2num(str4);
    %%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
    % Выбираем функцию из списка
    %%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
    index=get(hList,'Value');
    cellArr=get(hList,'String');
    funName=cellArr{index};
    dx=(xf-x0)/N; X=x0; Y=y0;
    for k=1:N
        Y = [Y, Y(end)+feval(funName,X(end))*dx];
        X = [X, X(end)+dx];
    end
    %%%%%%%%%%%%%%%%%%%%%%%%%%%%%
    % Можно было так:
    %%%%%%%%%%%%%%%%%%%%%%%%%%%%%
    % X = zeros(N + 1); X(1) = x0;
    % Y = zeros(N + 1); Y(1) = y0;
    % for k=1:N
    %    Y(i + 1) = [Y(i)+feval(funName, X(i))*dx];
    %    X(i + 1) = X(i) + dx;
    % end
    %%%%%%%%%%%%%%%%%%%%%%%%%%%%%
    % или даже так:
    %%%%%%%%%%%%%%%%%%%%%%%%%%%%%
    % X = x0 + dx * (0:N);
    % Y = zeros(N + 1); Y(1) = y0;
    % for k=1:N
    %    Y(i + 1) = [Y(i)+feval(funName, X(i))*dx];
    % end
    %%%%%%%%%%%%%%%%%%%%%%%%%%%%%

    %%%%%%%%%%%%%%%%%%%%%%%%%%%%%
    % Рисуем график
    %%%%%%%%%%%%%%%%%%%%%%%%%%%%%
    axes(hAxes);
    plot(X, Y);
end   



